<?php

namespace Database\Seeders;

use App\Models\District;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class DistrictSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $districts = [
            ['id' => '1', 'name' => 'ঢাকা'],
            ['id' => '2', 'name' => 'ফরিদপুর'],
            ['id' => '3', 'name' => 'গাজীপুর'],
            ['id' => '4', 'name' => 'গোপালগঞ্জ'],
            ['id' => '5', 'name' => 'জামালপুর'],
            ['id' => '6', 'name' => 'কিশোরগঞ্জ'],
            ['id' => '7', 'name' => 'মাদারীপুর'],
            ['id' => '8', 'name' => 'মানিকগঞ্জ'],
            ['id' => '9', 'name' => 'মুন্সীগঞ্জ'],
            ['id' => '10', 'name' => 'ময়মনসিংহ'],
            ['id' => '11', 'name' => 'নারায়ণগঞ্জ'],
            ['id' => '12', 'name' => 'নরসিংদী'],
            ['id' => '13', 'name' => 'নেত্রকোণা'],
            ['id' => '14', 'name' => 'রাজবাড়ী'],
            ['id' => '15', 'name' => 'শরীয়তপুর'],
            ['id' => '16', 'name' => 'শেরপুর'],
            ['id' => '17', 'name' => 'টাঙ্গাইল'],
            ['id' => '18', 'name' => 'বগুড়া'],
            ['id' => '19', 'name' => 'জয়পুরহাট'],
            ['id' => '20', 'name' => 'নওগাঁ'],
            ['id' => '21', 'name' => 'নাটোর'],
            ['id' => '22', 'name' => 'নবাবগঞ্জ'],
            ['id' => '23', 'name' => 'পাবনা'],
            ['id' => '24', 'name' => 'রাজশাহী'],
            ['id' => '25', 'name' => 'সিরাজগঞ্জ'],
            ['id' => '26', 'name' => 'দিনাজপুর'],
            ['id' => '27', 'name' => 'গাইবান্ধা'],
            ['id' => '28', 'name' => 'কুড়িগ্রাম'],
            ['id' => '29', 'name' => 'লালমনিরহাট'],
            ['id' => '30', 'name' => 'নীলফামারী'],
            ['id' => '31', 'name' => 'পঞ্চগড়'],
            ['id' => '32', 'name' => 'রংপুর'],
            ['id' => '33', 'name' => 'ঠাকুরগাঁও'],
            ['id' => '34', 'name' => 'বরগুনা'],
            ['id' => '35', 'name' => 'বরিশাল'],
            ['id' => '36', 'name' => 'ভোলা'],
            ['id' => '37', 'name' => 'ঝালকাঠি'],
            ['id' => '38', 'name' => 'পটুয়াখালী'],
            ['id' => '39', 'name' => 'পিরোজপুর'],
            ['id' => '40', 'name' => 'বান্দরবান'],
            ['id' => '41', 'name' => 'ব্রাহ্মণবাড়িয়া'],
            ['id' => '42', 'name' => 'চাঁদপুর'],
            ['id' => '43', 'name' => 'চট্টগ্রাম'],
            ['id' => '44', 'name' => 'কুমিল্লা'],
            ['id' => '45', 'name' => 'কক্সবাজার'],
            ['id' => '46', 'name' => 'ফেনী'],
            ['id' => '47', 'name' => 'খাগড়াছড়ি'],
            ['id' => '48', 'name' => 'লক্ষ্মীপুর'],
            ['id' => '49', 'name' => 'নোয়াখালী'],
            ['id' => '50', 'name' => 'রাঙামাটি'],
            ['id' => '51', 'name' => 'হবিগঞ্জ'],
            ['id' => '52', 'name' => 'মৌলভীবাজার'],
            ['id' => '53', 'name' => 'সুনামগঞ্জ'],
            ['id' => '54', 'name' => 'সিলেট'],
            ['id' => '55', 'name' => 'বাগেরহাট'],
            ['id' => '56', 'name' => 'চুয়াডাঙ্গা'],
            ['id' => '57', 'name' => 'যশোর'],
            ['id' => '58', 'name' => 'ঝিনাইদহ'],
            ['id' => '59', 'name' => 'খুলনা'],
            ['id' => '60', 'name' => 'কুষ্টিয়া'],
            ['id' => '61', 'name' => 'মাগুরা'],
            ['id' => '62', 'name' => 'মেহেরপুর'],
            ['id' => '63', 'name' => 'নড়াইল'],
            ['id' => '64', 'name' => 'সাতক্ষীরা'],
        ];

        foreach ($districts as $district) {
            District::create($district);
        }
    }
}
